# GeometryObject Operators

---
The GeometryObject type exposes the following members.
| Name| Description
---|---|---
| Equality(GeometryObject, GeometryObject)| Determines whether two GeometryObjects are the same.
| Inequality(GeometryObject, GeometryObject)| Determines whether two GeometryObjects are different.
Top
#### Reference
GeometryObject Class
Autodesk.Revit.DB Namespace